app/controllers/articles_controller.rb

INSERT INTO "articles" ("content", "created_at", "style", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @article = Article.new(article_params)
    @article.user_id=session[:user_id]
    respond_to do |format|
      if @article.save

UPDATE "articles" SET "style" = $1, "updated_at" = $2 WHERE "articles"."id" = 1  [["style", "感情"], ["updated_at", Sun, 24 Nov 2013 14:44:12 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)