app/controllers/home_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def welcome
  	@user=User.find_by(id: session[:user_id])