app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
    def set_user
      @user = User.find(params[:id])